Revit 2027 API
Document.GetRoomAtPoint(XYZ, Phase) Method
Gets a room containing the point.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Room GetRoomAtPoint(
	XYZ point,
	Phase phase
)
Public Function GetRoomAtPoint (
	point As XYZ,
	phase As Phase
) As Room
public:
Room^ GetRoomAtPoint(
	XYZ^ point,
	Phase^ phase
)
member GetRoomAtPoint :
        point : XYZ *
        phase : Phase -> Room
Parameters
point XYZ
Point to be checked.
phase Phase
Phase in which the room exists.
Return Value
Room
The room containing the point.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the point is null.
ArgumentException |  Thrown when the coordinates of the point are not number or are Double::MaxValue or Double::MinValue.
Remarks
If phase is null, it will get the room of the last phase.The first one found will be returned. If there is no room containing the point, it returns null.
See Also
Reference
Document Class
GetRoomAtPoint Overload
Autodesk.Revit.DB Namespace